lib/tasks/make_carborn_footprint.rake

  task :create_emitted_co2 => :environment do
    @emitted_co2=[89.43,35.98,2.713,2.687,2.479,2.457,2.438,2.39,2.509,2.501,2.112,2.168,2.316,2.301,2.261,
    2.231,2.061,53.85,2.487,2.427,2.416,2.412,2.405,2.383,2.349,2.587,2.668,2.09,2.16,2.157,2.149,2.142]
    @emitted_co2.each do |value|
      Carbonfootprint.create(:co2_emitted => value)
---
INSERT INTO "carbonfootprints" ("co2_emitted", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["co2_emitted", 89], ["created_at", "2021-05-26 14:28:44.755907"], ["updated_at", "2021-05-26 14:28:44.755907"]]

  task :create_sequested_co2 => :environment do
    @sequested_co2=[96.77,38.50,2.935,2.907,2.683,2.659,2.639,2.587,2.715,2.707,2.286,2.346,2.506,2.49,2.446,2.414,
    2.182,58.27,2.691,2.627,2.615,2.611,2.603,2.579,2.542,2.799,2.887,2.262,2.338,2.334,2.326,2.318]
    @sequested_co2.each do |value|
      Carbonfootprint.update(:co2sequestered => value)
---
UPDATE "carbonfootprints" SET "co2sequestered" = $1, "updated_at" = $2 WHERE "carbonfootprints"."id" = $3  [["co2sequestered", 96.77], ["updated_at", "2021-05-26 16:26:46.691579"], ["id", 33]]

  task :total_co2 => :environment do
    @total_co2=[-7.345,-2.923,-0.223,-0.221,-0.204,-0.202,-0.2,-0.196,-0.206,-0.205,-0.174,-0.178,-0.19,-0.189,
      -0.186,-0.183,-0.166,-4.422,-0.204,-0.199,-0.198,-0.198,-0.198,-0.196,-0.193,-0.212,-0.219,-0.172,-0.177,-0.177,-0.177]
    @total_co2.each do |value|
      Carbonfootprint.update(:co2total => value)
---
UPDATE "carbonfootprints" SET "co2sequestered" = $1, "co2total" = $2, "updated_at" = $3 WHERE "carbonfootprints"."id" = $4  [["co2sequestered", 96.77], ["co2total", -7.345], ["updated_at", "2021-05-26 16:41:59.953580"], ["id", 128]]

  task :additional_co2_values => :environment do
     @sequested_co2=[96.77,38.50,2.935,2.907,2.683,2.659,2.639,2.587,2.715,2.707,2.286,2.346,2.506,2.49,2.446,2.414,
    2.182,58.27,2.691,2.627,2.615,2.611,2.603,2.579,2.542,2.799,2.887,2.262,2.338,2.334,2.326,2.318]
    @total_co2=[-7.345,-2.923,-0.223,-0.221,-0.204,-0.202,-0.2,-0.196,-0.206,-0.205,-0.174,-0.178,-0.19,-0.189,
      -0.186,-0.183,-0.166,-4.422,-0.204,-0.199,-0.198,-0.198,-0.198,-0.196,-0.193,-0.212,-0.219,-0.172,-0.177,-0.177,-0.177]
    i = 0
      Carbonfootprint.all.each do |value|
---
SELECT "carbonfootprints".* FROM "carbonfootprints"