app/controllers/home_controller.rb

SELECT "animals".* FROM "animals" WHERE "animals"."eartag" = $1 LIMIT $2  [["eartag", "asdasd"], ["LIMIT", 1]]
SELECT "animals".* FROM "animals" WHERE "animals"."eartag" = $1 LIMIT $2  [["eartag", "8011"], ["LIMIT", 1]]
---
  def show
    @animal = Animal.find_by!(eartag: params[:id])
    report_data = Rails.cache.fetch("animals/#{params[:id]}/diet") do
      bovisync = Bovisync.new
      animal = Animal.find_by!(eartag: params[:id])

SELECT "animals".* FROM "animals" WHERE "animals"."eartag" = $1 LIMIT $2  [["eartag", "8011"], ["LIMIT", 1]]
---
  def animal_diet
    report_data = Rails.cache.fetch("animals/#{params[:id]}/diet") do
      bovisync = Bovisync.new
      animal = Animal.find_by!(eartag: params[:id])

SELECT "animals".* FROM "animals" WHERE "animals"."eartag" = $1 LIMIT $2  [["eartag", "8011"], ["LIMIT", 1]]
SELECT "animals"."bovisync_id" FROM "animals" WHERE "animals"."eartag" = $1  [["eartag", "8011"]]
---
  def animal_life
    report_data = Rails.cache.fetch("animals/#{params[:id]}/life") do
      bovisync = Bovisync.new
      animals = Animal.where(eartag: params[:id])
      animal_ids = animals.pluck(:bovisync_id)