app/models/bovisync_animal.rb

  def farms
    farm_names = allfarmslife.split(',').map(&:strip).collect { |farm| farm == 'Royal Feed Lot' ? 'Royal Ranch' : farm }
    farm_names.map do |name|
      Farm.find_or_create_by(name: name)
---
INSERT INTO "farms" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Royal Dairy"], ["created_at", "2021-05-26 15:38:53.987067"], ["updated_at", "2021-05-26 15:38:53.987067"]]
SELECT "farms".* FROM "farms" WHERE "farms"."name" = $1 LIMIT $2  [["name", "Royal Dairy"], ["LIMIT", 1]]

  def birth_farm
    farm = farms.first
    return farm unless farm.name == 'Royal Dairy'

    Farm.find_or_create_by(name: 'Royal Ranch')
---
SELECT "farms".* FROM "farms" WHERE "farms"."name" = $1 LIMIT $2  [["name", "Royal Ranch"], ["LIMIT", 1]]

  def conversion_farm
    Farm.find_or_create_by(name: "Abe's Kosher Meats") do |farm|
---
INSERT INTO "farms" ("name", "city", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Abe's Kosher Meats"], ["city", "Burley"], ["state", "ID"], ["created_at", "2021-05-26 15:38:54.130773"], ["updated_at", "2021-05-26 15:38:54.130773"]]
SELECT "farms".* FROM "farms" WHERE "farms"."name" = $1 LIMIT $2  [["name", "Abe's Kosher Meats"], ["LIMIT", 1]]